; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v11)
             (pred_6 ?v8 ?v3)
             (pred_8 ?v5 ?v3)
             (pred_11 ?v6 ?v5 )
	     (pred_12 ?v5)
             (pred_2 ?v13)
             (pred_3 ?v8)
             (pred_4 ?v3)
             (pred_5 ?v5)
             (pred_7 ?v8)
             (pred_1 ?v5)
             (pred_10 ))



(:action op_2
:parameters (?v9 ?v7 ?v12 ?v2)
:precondition (and (pred_2 ?v9) (pred_2 ?v7) (pred_3 ?v12) (pred_4 ?v2)
          (pred_9 ?v9 ?v7) (pred_6 ?v12 ?v2)
                   (pred_8 ?v7 ?v2) (pred_12 ?v9) 
                   (pred_5 ?v7) (pred_7 ?v12))
:effect (and  (pred_1 ?v7) (not (pred_5 ?v7))))


(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_2 ?v9) (pred_2 ?v10)
               (pred_12 ?v9) (pred_9 ?v9 ?v10) (pred_1 ?v10))
:effect (and (pred_12 ?v10) (not (pred_12 ?v9))))

(:action op_5
:parameters (?v9 ?v12)
:precondition (and (pred_2 ?v9) (pred_3 ?v12) 
                  (pred_12 ?v9) (pred_11 ?v12 ?v9) (pred_10 ))
:effect (and (pred_7 ?v12)
   (not (pred_11 ?v12 ?v9)) (not (pred_10 ))))


(:action op_3
:parameters (?v9 ?v1 ?v4)
:precondition (and (pred_2 ?v9) (pred_3 ?v1) (pred_3 ?v4)
                  (pred_12 ?v9) (pred_7 ?v4) (pred_11 ?v1 ?v9))
:effect (and (pred_7 ?v1) (pred_11 ?v4 ?v9)
        (not (pred_7 ?v4)) (not (pred_11 ?v1 ?v9))))

(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_2 ?v9) (pred_3 ?v12) 
                  (pred_12 ?v9) (pred_7 ?v12))
:effect (and (pred_10 ) (pred_11 ?v12 ?v9) (not (pred_7 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_03 obj_06 obj_17 obj_01 obj_19 obj_05 obj_15 obj_04 obj_10 obj_02 obj_12 obj_18 obj_07 obj_21 obj_16
    obj_14 obj_20
    obj_08 obj_09 obj_13
    )

    (:init
       (pred_10)

       (pred_2 obj_11)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_10)
       (pred_2 obj_02)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_07)
       (pred_2 obj_21)
       (pred_2 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_20)
       (pred_3 obj_08)
       (pred_3 obj_09)
       (pred_3 obj_13)

       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_03)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_06 obj_05)
       (pred_9 obj_06 obj_17)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_06)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_05 obj_06)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_02 obj_21)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_18 obj_07)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_18)
       (pred_9 obj_21 obj_16)
       (pred_9 obj_21 obj_02)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_16 obj_21)
       (pred_5 obj_06)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_8  obj_06 obj_14)
       (pred_8  obj_07 obj_20)
       (pred_8  obj_18 obj_20)
       (pred_1 obj_11)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_05)
       (pred_1 obj_15)
       (pred_1 obj_04)
       (pred_1 obj_10)
       (pred_1 obj_02)
       (pred_1 obj_12)
       (pred_1 obj_21)
       (pred_1 obj_16)

       (pred_6  obj_08 obj_14)
       (pred_6  obj_09 obj_20)
       (pred_6  obj_13 obj_14)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_13 obj_19)
       (pred_12 obj_03)
    )

    (:goal (and
       (pred_11 obj_08 obj_06)
    ))
(:constraints
  (always (not (pred_12 obj_05)))
)
)

; plan
1. (op_1 obj_03 obj_19)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_19)
   goals met: 0 of 1
2. (op_5 obj_19 obj_13)
   deleted: (pred_11 obj_13 obj_19) (pred_10)
   added: (pred_7 obj_13)
   goals met: 0 of 1
3. (op_1 obj_19 obj_10)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_02)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_02)
   goals met: 0 of 1
5. (op_3 obj_02 obj_08 obj_13)
   deleted: (pred_7 obj_13) (pred_11 obj_08 obj_02)
   added: (pred_7 obj_08) (pred_11 obj_13 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_10)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_10)
   goals met: 0 of 1
7. (op_1 obj_10 obj_19)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_19)
   goals met: 0 of 1
8. (op_1 obj_19 obj_03)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_03)
   goals met: 0 of 1
9. (op_2 obj_03 obj_06 obj_08 obj_14)
   deleted: (pred_5 obj_06)
   added: (pred_1 obj_06)
   goals met: 0 of 1
10. (op_1 obj_03 obj_06)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_06)
   goals met: 0 of 1
11. (op_4 obj_06 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_10) (pred_11 obj_08 obj_06)
   goals met: 1 of 1
